#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # ibm_container_cluster.tfcluster[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "ibm_container_cluster" "tfcluster" {
      [32m+[0m [0m[1m[0malbs[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mcrn[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mdatacenter[0m[0m                   = "fra02"
      [32m+[0m [0m[1m[0mdefault_pool_size[0m[0m            = 1
      [32m+[0m [0m[1m[0mdisk_encryption[0m[0m              = true
      [32m+[0m [0m[1m[0mforce_delete_storage[0m[0m         = false
      [32m+[0m [0m[1m[0mgateway_enabled[0m[0m              = false
      [32m+[0m [0m[1m[0mhardware[0m[0m                     = "shared"
      [32m+[0m [0m[1m[0mid[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mingress_hostname[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mingress_secret[0m[0m               = (sensitive value)
      [32m+[0m [0m[1m[0mkube_version[0m[0m                 = "1.21.7"
      [32m+[0m [0m[1m[0mlabels[0m[0m                       = {
          [32m+[0m [0m"test" = "test-pool"
        }
      [32m+[0m [0m[1m[0mmachine_type[0m[0m                 = "free"
      [32m+[0m [0m[1m[0mname[0m[0m                         = "tfcluster-daniel"
      [32m+[0m [0m[1m[0mno_subnet[0m[0m                    = true
      [32m+[0m [0m[1m[0mpod_subnet[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mprivate_service_endpoint[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mprivate_service_endpoint_url[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprivate_vlan_id[0m[0m              = "vlan"
      [32m+[0m [0m[1m[0mpublic_service_endpoint[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mpublic_service_endpoint_url[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mpublic_vlan_id[0m[0m               = "vlan"
      [32m+[0m [0m[1m[0mregion[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mresource_controller_url[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mresource_crn[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mresource_name[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mresource_status[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mserver_url[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mservice_subnet[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mupdate_all_workers[0m[0m           = false
      [32m+[0m [0m[1m[0mwait_for_worker_update[0m[0m       = true
      [32m+[0m [0m[1m[0mwait_till[0m[0m                    = "IngressReady"
      [32m+[0m [0m[1m[0mworker_num[0m[0m                   = 0
      [32m+[0m [0m[1m[0mworker_pools[0m[0m                 = (known after apply)

      [32m+[0m [0mwebhook {
          [32m+[0m [0m[1m[0mlevel[0m[0m = "Normal"
          [32m+[0m [0m[1m[0mtype[0m[0m  = "slack"
          [32m+[0m [0m[1m[0murl[0m[0m   = "https://hooks.slack.com/services/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"
        }

      [32m+[0m [0mworkers_info {
          [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mpool_name[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mversion[0m[0m   = (known after apply)
        }
    }

[1m  # ibm_cr_namespace.cr_namespace[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "ibm_cr_namespace" "cr_namespace" {
      [32m+[0m [0m[1m[0maccount[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mcreated_date[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mcreated_on[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mcrn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                  = "ibm-daniels-workspace"
      [32m+[0m [0m[1m[0mresource_created_date[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_id[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mupdated_date[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mupdated_on[0m[0m            = (known after apply)
    }

[0m[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: apply_this.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "apply_this.tfplan"
```

</details>

*Pusher: @danielgeerts7, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*